{
  "version": "1.1",
  "lastUpdated": "2026-01-23",

  "placeholders": {
    "companyName": "[Company Name]",
    "clientName": "[Client Name]",
    "preparedBy": "[Prepared By]",
    "contactEmail": "[contact@example.com]",
    "contactPhone": "[+1 (XXX) XXX-XXXX]"
  },

  "coverPage": {
    "title": "VMware Cloud Migration Assessment",
    "subtitle": "Migration Analysis and Recommendations for IBM Cloud",
    "documentType": "Technical Assessment Report"
  },

  "tableDescriptions": {
    "environmentSummary": {
      "title": "Environment Summary Metrics",
      "description": "This table establishes the baseline resource requirements for migration planning. Total VMs (Powered On) counts only active virtual machines that require migration capacity on the target platform—powered-off VMs are excluded as they don't consume runtime resources. Total vCPUs represents the aggregate virtual CPU allocation across all powered-on VMs, calculated by summing each VM's configured CPU count; this determines the compute capacity needed on IBM Cloud. Total Memory is the sum of memory allocated to all powered-on VMs, converted to TiB (1 TiB = 1,024 GiB). Total Storage represents the provisioned disk capacity across all VMs—this is the \"thick provisioned\" value, not actual data consumption, ensuring adequate storage is planned. Clusters and ESXi Hosts provide context about the source infrastructure's scale and help identify potential affinity or anti-affinity requirements that may need to be replicated in the target environment."
    },
    "infrastructureOverview": {
      "title": "Infrastructure Components",
      "description": "Understanding the source infrastructure composition is critical for migration planning. vCenter Servers indicates the number of management domains—multiple vCenters may require separate migration streams or coordination. Clusters represent logical groupings of hosts with shared resources and HA/DRS policies; each cluster may become a separate availability zone or worker pool in the target environment. ESXi Hosts count the physical servers running VMs—this helps assess the consolidation ratio and validate that the source environment is representative. Virtual Machines is the total VM count including templates and powered-off VMs, providing the full inventory scope. Datastores count shared storage volumes; fewer, larger datastores typically indicate simpler storage architecture, while many small datastores may suggest storage tiering or departmental separation that needs consideration during migration."
    },
    "computeResources": {
      "title": "Compute Resource Allocation",
      "description": "Compute resource analysis is essential for accurate target platform sizing and cost estimation. Total vCPUs Allocated is calculated by summing the CPU count of every powered-on VM (excluding templates and VMware infrastructure VMs). This value represents the worst-case CPU demand if all VMs were simultaneously active. For ROKS sizing, this value is divided by the CPU overcommit ratio (typically 1.8:1) to determine physical core requirements. Total Memory Allocated sums the memory configuration of all powered-on VMs and represents the firm capacity requirement—unlike CPU, memory is not typically overcommitted for virtualized workloads. Average vCPUs per VM (Total vCPUs ÷ VM Count) indicates the typical VM size in your environment; values of 2-4 suggest standard workloads suitable for balanced VSI profiles, while higher averages may indicate database or compute-intensive applications. Average Memory per VM helps identify whether the environment is memory-constrained, which influences profile family selection (memory-optimized profiles for high averages)."
    },
    "storageMetrics": {
      "title": "Storage Capacity and Utilization",
      "description": "Storage metrics directly impact migration timelines and ongoing operational costs. Total Datastore Capacity represents the raw storage provisioned to VMware datastores—this is the addressable storage from underlying SAN, NAS, or local storage. Total Datastore Used shows actual data consumption within those datastores, calculated from VMware's reported space utilization. Datastore Utilization (Used ÷ Capacity × 100) indicates storage efficiency; values above 80% suggest the environment may be capacity-constrained. Total VM Storage Provisioned sums the provisioned disk sizes across all VMs—this may exceed datastore capacity if thin provisioning is used and represents the storage that must be available on the target platform. Average Storage per VM helps estimate per-VM storage costs and identify outliers that may require special handling. For ROKS migrations, storage values are multiplied by 3 (ODF replication factor) and divided by 0.75 (operational capacity) to determine required NVMe capacity."
    },
    "networkComponents": {
      "title": "Network Configuration Summary",
      "description": "Network configuration complexity significantly impacts migration planning and target architecture design. Total NICs counts all virtual network adapters across all VMs—VMs with multiple NICs often have network segmentation requirements that must be preserved in the target environment. Port Groups represent logical network segments analogous to VLANs; each port group typically maps to an IBM Cloud VPC subnet. The port group count indicates the number of distinct network segments requiring recreation. Virtual Switches count the virtual networking infrastructure; standard vSwitches provide basic connectivity while distributed vSwitches may have advanced features (traffic shaping, NetFlow) that need equivalent IBM Cloud configurations. A high ratio of NICs to VMs indicates multi-homed configurations common in DMZ or application tiering scenarios that require careful network architecture planning."
    },
    "migrationReadiness": {
      "title": "Migration Readiness Summary",
      "description": "Migration readiness categorization enables prioritized planning and accurate timeline estimation. Ready to Migrate VMs pass all pre-flight checks and can proceed to migration without additional preparation—these are candidates for early migration waves to validate procedures. The Ready percentage (Ready Count ÷ Total × 100) indicates overall migration readiness; environments with >80% ready typically have straightforward migration paths. Needs Preparation VMs have non-blocking issues (outdated VMware Tools, old hardware version) that should be addressed but won't prevent migration. Has Blockers VMs cannot be migrated until issues are resolved; each blocker adds remediation time to the migration schedule. The blocker percentage directly impacts project timeline—10% blockers in a 500 VM environment means 50 VMs requiring individual attention before migration can complete."
    },
    "blockerVMs": {
      "title": "Virtual Machines with Migration Blockers",
      "description": "Each VM listed has one or more critical issues preventing migration. VM Name and Cluster help locate the VM in the source environment for remediation. Issues describes the specific blockers: 'No VMware Tools' means the guest agent isn't installed, preventing proper shutdown/startup coordination and guest customization—install VMware Tools before migration. 'Old Snapshots (>30d)' indicates snapshot chains that increase migration time, risk data corruption, and consume excess storage—consolidate or delete snapshots before migration. 'RDM Disk' indicates Raw Device Mappings where the VM accesses physical storage directly, bypassing the VMFS layer—these require storage reconfiguration or conversion to virtual disks. 'Unsupported OS' means the guest operating system isn't certified for the target platform—requires OS upgrade or acceptance of unsupported status. Resolution of these blockers is mandatory before the VM can be included in a migration wave."
    },
    "warningVMs": {
      "title": "Virtual Machines with Warnings",
      "description": "VMs with warnings can technically be migrated but may experience issues or suboptimal performance. VM Name and Cluster identify the affected systems. Common warnings include: 'HW Version v[X]' indicates virtual hardware older than recommended—while functional, older hardware versions may lack features and performance optimizations available in newer versions. Consider upgrading virtual hardware during a maintenance window before migration. 'Outdated VMware Tools' means the guest agent is installed but out of date—newer versions provide better performance and compatibility. These warnings represent technical debt that, while not blocking, should be addressed to ensure optimal post-migration operation. Prioritize warning remediation based on business criticality of the affected VMs."
    },
    "migrationComparison": {
      "title": "Migration Platform Comparison",
      "description": "This comparison supports platform selection by highlighting fundamental differences in architecture and operational model. Migration Approach indicates whether VMs run on a container orchestration platform (ROKS) or traditional IaaS (VSI)—this choice affects operational procedures and skill requirements. Infrastructure type affects performance characteristics: bare metal provides consistent performance while shared infrastructure offers cost efficiency. Storage architecture differs significantly: ODF provides software-defined storage with automatic replication versus block storage volumes requiring explicit backup configuration. Modernization Path indicates future options: ROKS positions workloads for eventual containerization while VSI maintains traditional VM operations. Operational Model determines day-to-day management: Kubernetes/GitOps requires new skills but enables automation, while traditional management leverages existing expertise. Consider your organization's strategic direction, team capabilities, and workload characteristics when selecting the target platform."
    },
    "roksSizing": {
      "title": "Recommended ROKS Cluster Configuration",
      "description": "This configuration ensures adequate capacity for running all assessed workloads on OpenShift Virtualization. Bare Metal Profile specifies the IBM Cloud server configuration—bx2d.metal.96x384 provides 96 threads, 384 GiB RAM, and 1.6 TB NVMe per node, optimized for virtualization workloads. Worker Nodes (N+2) includes two additional nodes beyond minimum requirements: one for maintenance operations (node cordoning during updates) and one for failure tolerance (automatic workload redistribution if a node fails). Total Physical Cores and Threads indicate aggregate compute capacity; OpenShift reserves ~15% for system services, with remaining capacity available for VM workloads. Total Memory is the raw RAM across all workers; system reservations of ~16 GiB per node reduce usable capacity. Total Raw NVMe is the aggregate local storage before ODF configuration. ODF Usable Storage is the effective capacity after 3-way replication (÷3) and operational overhead (×0.75)—this is the actual storage available for VM disks and must exceed total VM storage requirements."
    },
    "vsiProfileFamilies": {
      "title": "VSI Profile Family Reference",
      "description": "Understanding profile families is essential for cost-effective VM placement. Profile families are optimized for different workload types based on the CPU-to-memory ratio. Balanced (bx2) profiles with 1:4 ratio (1 vCPU per 4 GiB RAM) suit general-purpose workloads including web servers, application servers, and development environments—this is the most common choice for typical enterprise VMs. Compute (cx2) profiles with 1:2 ratio (1 vCPU per 2 GiB RAM) are optimized for CPU-intensive workloads including batch processing, high-performance computing, and build servers—choose when VMs are CPU-bound rather than memory-bound. Memory (mx2) profiles with 1:8 ratio (1 vCPU per 8 GiB RAM) target memory-intensive applications including databases, caching layers, and analytics platforms—select when VMs have high memory-to-CPU ratios. Profile selection is automatic based on source VM configuration: VMs with memory-to-CPU ratio ≤2.5 map to Compute, ≥6 map to Memory, and between map to Balanced."
    },
    "vsiMappings": {
      "title": "VM to VSI Profile Mappings",
      "description": "Each source VM is mapped to the smallest VSI profile that meets or exceeds its resource requirements. VM Name identifies the source virtual machine. vCPUs shows the source VM's CPU allocation—the target profile will have equal or greater vCPU count. Memory shows RAM allocation in GiB—the target profile will provide equal or greater memory. Profile shows the selected IBM Cloud VSI profile following the naming convention: family prefix (bx2/cx2/mx2), generation (2), and size (e.g., bx2-8x32 means balanced family with 8 vCPUs and 32 GiB RAM). The mapping algorithm selects the smallest profile within the appropriate family that satisfies both CPU and memory requirements, optimizing for cost while ensuring adequate resources. VMs may be slightly over-provisioned when source configurations don't align exactly with available profile sizes."
    },
    "costComparison": {
      "title": "Monthly Cost Comparison",
      "description": "This comparison provides budgetary guidance based on IBM Cloud list pricing for the US South region. Platform identifies the migration target (ROKS with bare metal or VPC VSI). Compute costs for ROKS reflect bare metal server pricing including OpenShift licensing; VSI compute costs sum the monthly rates for all mapped VSI profiles. Storage for ROKS shows 'Included' because ODF uses local NVMe drives included in the bare metal price; VSI storage costs are calculated separately based on block storage volumes. Monthly Total represents recurring infrastructure costs; Annual Total extrapolates to yearly expenditure for budgeting. These estimates use list pricing without enterprise discounts, reserved capacity savings, or promotional pricing—actual costs may be 20-50% lower with negotiated agreements. The cost difference between platforms should be weighed against operational benefits, skill requirements, and strategic alignment."
    },
    "vsiStorageBreakdown": {
      "title": "VSI Storage Cost Breakdown",
      "description": "Block storage costs are separated by volume type to show cost drivers. Storage Type distinguishes Boot Volumes (OS disks) from Data Volumes (application and data disks). Capacity shows total GiB across all volumes of that type; boot volumes are sized at minimum 100 GiB each, with remaining VM storage allocated to data volumes. Profile indicates the IOPS tier: boot volumes require general-purpose (3 IOPS/GB) at $0.08/GB while data volumes are distributed across tiers based on assumed workload mix (50% general-purpose, 30% 5iops-tier at $0.10/GB, 20% 10iops-tier at $0.13/GB). Monthly Cost multiplies capacity by the effective per-GB rate. This tiered approach balances cost and performance—adjust the tier distribution based on actual workload I/O requirements. High-performance databases may need more 10iops-tier allocation; file servers may use entirely general-purpose storage."
    }
  },

  "figureDescriptions": {
    "powerStateDistribution": {
      "title": "VM Power State Distribution",
      "description": "This chart visualizes the operational state of all virtual machines in the assessed environment. Powered On (green) VMs are actively running and consuming compute, memory, and storage resources—these form the primary migration scope and determine target platform sizing requirements. Powered Off (blue) VMs exist but aren't running; these may be disaster recovery replicas, templates, seasonal workloads, or decommissioned systems. Review powered-off VMs with stakeholders to determine whether they need migration capacity or can be excluded/retired, potentially reducing costs. Suspended VMs (orange) have their memory state saved to disk and can be resumed—treat these as powered-on for sizing purposes as they may be resumed at any time. A high proportion of powered-off VMs (>20%) warrants investigation, as migrating unused VMs wastes resources while failing to migrate needed systems creates gaps."
    },
    "migrationReadiness": {
      "title": "Migration Readiness Assessment",
      "description": "This chart provides an at-a-glance assessment of migration complexity based on pre-flight check results. Ready (green) VMs have passed all validation checks: VMware Tools installed and current, no problematic snapshots, no RDM disks, supported operating system, and adequate virtual hardware version. These VMs can proceed to migration immediately and are ideal candidates for early migration waves to validate procedures. Needs Prep (orange) VMs have warnings that should be addressed but aren't migration blockers—typically outdated VMware Tools or older virtual hardware versions. Plan remediation during normal maintenance windows. Blocked (red) VMs have critical issues requiring resolution before migration: missing VMware Tools prevents graceful guest operations, snapshots over 30 days old risk corruption and extend migration times, RDM disks require storage reconfiguration, and unsupported operating systems need upgrades. The ratio of segments directly impacts project timeline—each blocked VM adds investigation and remediation effort."
    },
    "vcpuDistribution": {
      "title": "vCPU Distribution by VM Size",
      "description": "This distribution chart reveals the compute profile of workloads, essential for target platform sizing and profile selection. Each segment represents a vCPU size bucket with the VM count and percentage. Small VMs (1-2 vCPUs) typically include lightweight services, monitoring agents, and utility servers—these efficiently consolidate onto shared infrastructure. Standard VMs (3-4 vCPUs) represent typical application servers and are most cost-effective on balanced profiles. Medium VMs (5-8 vCPUs) often run databases or application servers with moderate load—these map well to both balanced and compute profiles. Large VMs (9-16 vCPUs) typically support enterprise applications, databases, or multi-threaded workloads—ensure target profiles have equivalent capacity. Very large VMs (17+ vCPUs) require the largest available profiles and may be candidates for bare metal or specialized configurations. A right-skewed distribution (dominated by small VMs) suggests good VSI fit; a flatter distribution may benefit from ROKS's flexible resource allocation."
    },
    "memoryDistribution": {
      "title": "Memory Distribution by VM Size",
      "description": "Memory allocation patterns critically influence target platform selection and cost optimization. Small memory VMs (0-4 GiB) suit lightweight workloads and pair with compute profiles if CPU-bound. Standard VMs (5-8 GiB) represent balanced configurations common for web servers and application tiers. Medium VMs (9-16 GiB) are typical for departmental applications and small databases—balanced profiles are usually cost-effective. Memory-intensive VMs (17-32 GiB) often run databases, caching layers, or analytics—consider memory-optimized profiles (mx2) for better cost-performance ratio. Large memory VMs (33-64 GiB) typically support enterprise databases or in-memory analytics—ensure adequate profile availability. Very large VMs (65+ GiB) require the largest memory profiles and may exceed standard VSI limits; ROKS bare metal nodes with 384+ GiB RAM accommodate these workloads. The memory-to-CPU ratio across segments indicates whether the environment favors balanced, compute, or memory profiles. A heavy tail toward high memory suggests memory-optimized profiles will be frequently selected."
    },
    "storageByType": {
      "title": "Storage Capacity by Datastore Type",
      "description": "Storage type distribution informs target storage architecture and performance tier selection. VMFS (VMware File System) is block-based storage commonly backed by SAN/iSCSI—this maps directly to IBM Cloud Block Storage volumes with configurable IOPS tiers. Choose higher IOPS tiers (5iops or 10iops) for datastores hosting databases or I/O-intensive workloads. NFS datastores use network-attached storage and may indicate file-based workflows—consider IBM Cloud File Storage for workloads requiring shared access across multiple VMs. vSAN uses local storage pooled across hosts with software-defined replication—ROKS with ODF provides similar capabilities with Ceph-based replication. Local storage indicates VMs using host-local disks without replication—these require careful handling as data isn't protected by the storage layer. The capacity shown (in GiB) for each type helps estimate storage costs: block storage costs vary by IOPS tier while ODF storage is included in ROKS bare metal pricing."
    },
    "osDistribution": {
      "title": "Operating System Distribution",
      "description": "Operating system composition affects licensing requirements, migration tools, and platform compatibility. For VPC VSI: Most 64-bit operating systems built for the x86-64 architecture can run on IBM Cloud VPC Virtual Server Instances. IBM provides and validates support for a set of stock x86-64 OS images (RHEL 7+, Ubuntu 18.04+, Windows Server 2012+, SLES, Debian, Rocky Linux, CentOS Stream) that are tested to boot and operate on VSIs. While you can import and use custom images (including unsupported operating systems), it is the customer's responsibility to validate functionality and compatibility for those imported or unsupported OS images. Windows Server requires appropriate licensing: BYOL with Software Assurance or IBM Cloud-provided licenses at additional cost. Red Hat Enterprise Linux (RHEL) is fully supported on both ROKS (included in licensing) and VSI (BYOL or IBM-provided). CentOS/Rocky Linux are community distributions compatible with Red Hat tooling—note CentOS 8 reached end-of-life. Other/Unknown operating systems can still be imported as custom images but require customer validation for compatibility."
    }
  },

  "executiveSummary": {
    "title": "Executive Summary",
    "introduction": "This report provides a comprehensive analysis of the current VMware vSphere environment and presents migration options to IBM Cloud. The assessment includes infrastructure inventory, migration readiness evaluation, target platform recommendations, and estimated costs.",
    "keyFindings": {
      "title": "Key Findings",
      "environmentOverview": "The analysis covers the complete VMware environment including all virtual machines, hosts, clusters, and storage infrastructure. This data has been extracted and analyzed to provide accurate migration planning information."
    },
    "recommendations": {
      "title": "Recommendations",
      "intro": "Based on the analysis of the source environment, the following migration approaches are recommended:",
      "roksTitle": "IBM Cloud Red Hat OpenShift (ROKS)",
      "roksRecommended": "ROKS with OpenShift Virtualization is ideal for organizations that want:",
      "roksReasons": [
        "Portability: Run workloads on-premises, on IBM Cloud, or across multiple cloud providers using the same Kubernetes-based platform",
        "Unified Platform: Operate both virtual machines and containers on a single infrastructure, enabling gradual application modernization",
        "Future-Ready: Leverage Kubernetes ecosystem tools, GitOps workflows, and cloud-native capabilities as your team evolves",
        "Hybrid Cloud: Consistent operations and workload mobility between environments using Red Hat OpenShift's hybrid cloud capabilities"
      ],
      "vsiTitle": "IBM Cloud VPC Virtual Servers (VSI)",
      "vsiRecommended": "VPC Virtual Servers are ideal for organizations that want:",
      "vsiReasons": [
        "Familiar Operations: Traditional VM management without requiring Kubernetes expertise or new operational skills",
        "Quick Migration: Straightforward lift-and-shift approach with minimal architectural changes",
        "Simplicity: Each VM maps directly to a VSI instance with well-understood IaaS operations",
        "Lower Learning Curve: IT teams can continue using existing VM management practices and tools"
      ]
    }
  },

  "environmentAnalysis": {
    "title": "Current Environment Analysis",
    "introduction": "This section provides a detailed breakdown of the existing VMware infrastructure based on the RVTools data analysis.",
    "sections": {
      "infrastructure": {
        "title": "Infrastructure Overview",
        "description": "The following table summarizes the VMware infrastructure components discovered during the assessment."
      },
      "compute": {
        "title": "Compute Resources",
        "description": "Analysis of CPU and memory allocation across all virtual machines in the environment."
      },
      "storage": {
        "title": "Storage Analysis",
        "description": "Overview of storage capacity, utilization, and datastore configuration."
      },
      "network": {
        "title": "Network Configuration",
        "description": "Summary of network adapters, port groups, and virtual switches in the environment."
      },
      "clusters": {
        "title": "Cluster Configuration",
        "description": "Details of VMware clusters including HA, DRS settings, and resource allocation."
      }
    }
  },

  "migrationReadiness": {
    "title": "Migration Readiness Assessment",
    "introduction": "Each virtual machine has been evaluated against migration readiness criteria to identify potential blockers and items requiring remediation before migration.",
    "readinessCategories": {
      "ready": {
        "label": "Ready",
        "description": "VMs that pass all migration readiness checks and can proceed with migration without additional preparation."
      },
      "needsPreparation": {
        "label": "Needs Preparation",
        "description": "VMs with warnings that should be addressed before migration but are not critical blockers."
      },
      "blocked": {
        "label": "Blocked",
        "description": "VMs with critical issues that must be resolved before migration can proceed."
      }
    },
    "checksPerformed": {
      "title": "Pre-Flight Checks Performed",
      "checks": [
        {
          "name": "VMware Tools",
          "description": "VMware Tools must be installed and running for proper guest OS integration during migration."
        },
        {
          "name": "Hardware Version",
          "description": "Virtual hardware version must meet minimum requirements for migration compatibility."
        },
        {
          "name": "Snapshots",
          "description": "VMs with old snapshots may experience migration issues. Snapshots should be consolidated."
        },
        {
          "name": "RDM Disks",
          "description": "Raw Device Mapped disks require special handling and may not be directly migratable."
        },
        {
          "name": "CD-ROM Connected",
          "description": "Connected CD/DVD drives should be disconnected before migration."
        },
        {
          "name": "Operating System",
          "description": "Guest operating system must be supported on the target platform."
        }
      ]
    },
    "blockersSummary": {
      "title": "VMs with Migration Blockers",
      "description": "The following virtual machines have critical issues that must be resolved before migration."
    },
    "warningsSummary": {
      "title": "VMs with Warnings",
      "description": "The following virtual machines have warnings that should be reviewed and addressed."
    }
  },

  "migrationOptions": {
    "title": "Migration Options",
    "introduction": "Two primary migration paths are available for moving VMware workloads to IBM Cloud. Each option has distinct characteristics that may make it more suitable depending on the organization's goals and requirements.",
    "comparisonIntro": "The following table compares the key characteristics of each migration approach."
  },

  "roksOverview": {
    "title": "IBM Cloud Red Hat OpenShift (ROKS)",
    "subtitle": "OpenShift Virtualization for VMware Migrations",
    "introduction": "Red Hat OpenShift on IBM Cloud (ROKS) is a fully managed OpenShift container platform that enables organizations to deploy, manage, and scale containerized applications. With OpenShift Virtualization (based on KubeVirt), ROKS can also run traditional virtual machines alongside containers on the same platform.",
    "whatIsRoks": {
      "title": "What is ROKS?",
      "content": "ROKS provides a managed Kubernetes environment with enterprise features including integrated CI/CD, monitoring, logging, and security. The platform runs on dedicated bare metal infrastructure with local NVMe storage, providing high-performance compute and storage for demanding workloads."
    },
    "architecture": {
      "title": "Architecture Overview",
      "content": "ROKS with OpenShift Virtualization uses bare metal worker nodes with local NVMe drives. OpenShift Data Foundation (ODF) provides software-defined storage with Ceph, delivering persistent block and file storage with built-in replication and high availability.",
      "components": [
        "Managed OpenShift control plane (provided by IBM)",
        "Dedicated bare metal worker nodes with local NVMe storage",
        "OpenShift Data Foundation (ODF) for persistent storage",
        "OpenShift Virtualization for running VMs as Kubernetes resources",
        "Integrated networking with VPC and IBM Cloud services"
      ]
    },
    "benefits": {
      "title": "Benefits for VMware Migrations",
      "items": [
        {
          "title": "Unified Platform",
          "description": "Run VMs and containers on the same infrastructure, enabling gradual application modernization."
        },
        {
          "title": "Kubernetes-Native Operations",
          "description": "Manage VMs using familiar Kubernetes tools, APIs, and GitOps workflows."
        },
        {
          "title": "High Performance Storage",
          "description": "Local NVMe drives with ODF provide high IOPS and low latency for demanding workloads."
        },
        {
          "title": "Built-in HA and DR",
          "description": "OpenShift's self-healing capabilities and ODF replication ensure workload availability."
        },
        {
          "title": "Path to Modernization",
          "description": "Migrate VMs first, then containerize applications at your own pace."
        }
      ]
    },
    "considerations": {
      "title": "Considerations",
      "items": [
        "Requires Kubernetes expertise for operations and troubleshooting",
        "Minimum 3-node cluster for ODF storage resilience",
        "Higher base cost due to bare metal infrastructure and storage replication",
        "Best suited for organizations planning application modernization"
      ]
    },
    "sizing": {
      "title": "Recommended Cluster Sizing",
      "description": "Based on the analysis of the source environment, the following ROKS cluster configuration is recommended.",
      "methodology": "Sizing calculations consider CPU requirements (with conservative 1.8:1 overcommit), memory (no overcommit for VMs), and storage (3x replication with ODF operational overhead)."
    }
  },

  "vsiOverview": {
    "title": "IBM Cloud VPC Virtual Servers",
    "subtitle": "Infrastructure-as-a-Service Migration",
    "introduction": "IBM Cloud VPC Virtual Servers (VSI) provide on-demand compute capacity in a secure, isolated virtual private cloud environment. VSIs offer a straightforward path for lift-and-shift migrations of VMware workloads with minimal architectural changes.",
    "whatIsVsi": {
      "title": "What are VPC Virtual Servers?",
      "content": "VPC Virtual Servers are virtual machine instances running on IBM Cloud's next-generation infrastructure. They offer a range of profiles optimized for different workload types, from compute-intensive applications to memory-heavy databases."
    },
    "architecture": {
      "title": "Architecture Overview",
      "content": "VSIs run within a Virtual Private Cloud (VPC), providing network isolation and security. Each VSI can have multiple network interfaces, block storage volumes, and can be deployed across multiple availability zones for high availability.",
      "components": [
        "Virtual server instances with dedicated vCPUs and memory",
        "VPC networking with security groups and ACLs",
        "Block storage volumes (boot and data) with snapshot capability",
        "Multiple availability zones for HA deployments",
        "Integration with IBM Cloud services and VPN connectivity"
      ]
    },
    "profileFamilies": {
      "title": "VSI Profile Families",
      "description": "VSI profiles are organized into families optimized for different use cases:",
      "families": [
        {
          "name": "Balanced (bx2)",
          "ratio": "1:4",
          "useCase": "General purpose workloads with balanced CPU and memory"
        },
        {
          "name": "Compute (cx2)",
          "ratio": "1:2",
          "useCase": "CPU-intensive applications, web servers, batch processing"
        },
        {
          "name": "Memory (mx2)",
          "ratio": "1:8",
          "useCase": "Memory-intensive databases, caching, analytics"
        }
      ]
    },
    "benefits": {
      "title": "Benefits for VMware Migrations",
      "items": [
        {
          "title": "Familiar IaaS Model",
          "description": "Traditional VM-based infrastructure similar to VMware, reducing the learning curve."
        },
        {
          "title": "Flexible Sizing",
          "description": "Wide range of profiles from 2 vCPU to 128 vCPU to match existing VM sizes."
        },
        {
          "title": "Pay-as-you-go",
          "description": "Hourly billing with no minimum commitment, with discounts for reserved capacity."
        },
        {
          "title": "Network Isolation",
          "description": "Complete network control with VPC, subnets, security groups, and ACLs."
        },
        {
          "title": "Enterprise Storage",
          "description": "High-performance block storage with multiple IOPS tiers and snapshot support."
        }
      ]
    },
    "considerations": {
      "title": "Considerations",
      "items": [
        "Each VM becomes an independent VSI instance",
        "Storage is attached via block volumes, not shared datastores",
        "Maximum profile size of 128 vCPU / 1024 GiB RAM for standard profiles",
        "Operating system licensing may be additional (BYOL or IBM-provided)"
      ]
    },
    "sizing": {
      "title": "VM to VSI Profile Mapping",
      "description": "Each source VM has been mapped to an appropriate IBM Cloud VSI profile based on its compute and memory requirements.",
      "methodology": "Profile selection considers the VM's vCPU count, memory allocation, and memory-to-CPU ratio to determine the optimal profile family (Balanced, Compute, or Memory)."
    }
  },

  "costEstimation": {
    "title": "Cost Estimation",
    "introduction": "The following cost estimates are based on IBM Cloud list pricing and the resource requirements calculated from the source environment analysis. Actual costs may vary based on negotiated discounts, reserved capacity commitments, and actual usage patterns.",
    "disclaimer": "These estimates are for planning purposes only. Contact IBM or an authorized partner for accurate pricing based on your specific requirements.",
    "sections": {
      "roks": {
        "title": "ROKS with OpenShift Virtualization",
        "description": "Cost estimate for running workloads on Red Hat OpenShift with bare metal infrastructure."
      },
      "vsi": {
        "title": "VPC Virtual Server Instances",
        "description": "Cost estimate for running workloads as individual VPC VSI instances."
      },
      "comparison": {
        "title": "Cost Comparison",
        "description": "Side-by-side comparison of monthly costs for each migration option."
      }
    },
    "notes": {
      "title": "Notes and Assumptions",
      "items": [
        "Costs shown are list prices without enterprise discounts",
        "Storage costs include the estimated in-use storage, not provisioned capacity",
        "Network egress and additional services are not included",
        "ROKS includes Red Hat OpenShift licensing in the infrastructure cost",
        "VSI costs do not include operating system licensing for non-Linux workloads"
      ]
    }
  },

  "nextSteps": {
    "title": "Recommended Next Steps",
    "introduction": "The following steps are recommended to proceed with the migration planning process.",
    "steps": [
      {
        "phase": "Phase 1: Detailed Planning",
        "items": [
          "Review and validate the migration readiness assessment findings",
          "Remediate identified blockers (VMware Tools, snapshots, RDM disks)",
          "Confirm target platform selection (ROKS or VSI)",
          "Develop detailed migration runbook and testing procedures"
        ]
      },
      {
        "phase": "Phase 2: Environment Preparation",
        "items": [
          "Provision IBM Cloud VPC and networking infrastructure",
          "Set up connectivity (Direct Link or VPN) to source environment",
          "Deploy target platform (ROKS cluster or VSI infrastructure)",
          "Configure storage and backup solutions"
        ]
      },
      {
        "phase": "Phase 3: Pilot Migration",
        "items": [
          "Select low-risk, non-critical VMs for pilot migration",
          "Execute pilot migration and validate functionality",
          "Document lessons learned and refine procedures",
          "Obtain stakeholder sign-off on migration approach"
        ]
      },
      {
        "phase": "Phase 4: Production Migration",
        "items": [
          "Execute migration in planned waves",
          "Validate each wave before proceeding to the next",
          "Monitor performance and address any issues",
          "Decommission source environment after successful migration"
        ]
      }
    ],
    "contact": {
      "title": "Contact Information",
      "content": "For questions about this assessment or to discuss next steps, please contact:"
    }
  },

  "appendix": {
    "title": "Appendix",
    "sections": {
      "methodology": {
        "title": "Assessment Methodology",
        "content": "This assessment was conducted using RVTools data exported from the VMware vSphere environment. RVTools collects comprehensive information about virtual machines, hosts, datastores, networks, and configuration settings. The data was analyzed using automated tools to identify migration readiness issues and calculate resource requirements."
      },
      "glossary": {
        "title": "Glossary of Terms",
        "terms": [
          { "term": "ROKS", "definition": "Red Hat OpenShift on IBM Cloud - IBM's managed OpenShift container platform service" },
          { "term": "VSI", "definition": "Virtual Server Instance - Virtual machine on IBM Cloud VPC infrastructure" },
          { "term": "VPC", "definition": "Virtual Private Cloud - Isolated network environment on IBM Cloud" },
          { "term": "ODF", "definition": "OpenShift Data Foundation - Software-defined storage solution for OpenShift" },
          { "term": "MTV", "definition": "Migration Toolkit for Virtualization - Tool for migrating VMs to OpenShift Virtualization" },
          { "term": "vCPU", "definition": "Virtual CPU - Logical processor allocated to a virtual machine" },
          { "term": "GiB", "definition": "Gibibyte - 1024^3 bytes, used for memory and storage measurements" },
          { "term": "TiB", "definition": "Tebibyte - 1024^4 bytes, used for large storage measurements" }
        ]
      }
    }
  }
}
